In [5]:
import numpy as np
import pandas as pd
path = "C:/Users/Abdullah Rashid/Desktop/Data Analysis with Python Udemy Course/Pandas+Course+Resources/Pandas Course Resources/retail/transactions.csv"
transactions = pd.read_csv(path)
transactions

             date  store_nbr  transactions
0      2013-01-01         25           770
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83488 rows x 3 columns]

In [8]:
transaction1 = transactions.iloc[1:][['store_nbr','transactions']] # transactions.loc[1:,['store_nbr','transactions']] will also give same results
transaction1 # transactions.iloc[1:,1:] will also give same result

       store_nbr  transactions
1              1          2111
2              2          2358
3              3          3487
4              4          1922
5              5          1903
...          ...           ...
83483         50          2804
83484         51          1573
83485         52          2255
83486         53           932
83487         54           802

[83487 rows x 2 columns]

In [14]:
transaction1['store_nbr'].nunique() # transactions.loc[:,'store_nbr'].nunique()

54

In [32]:
total_trans=transaction1['transactions'].sum() / 1000000  # sum of transactions

print(f"{total_trans.astype('int')} Million")

141 Million